/* ================================
let a = prompt ('Введите число')
alert (a ** 2)
===================================*/
/* =====================================
let a = +prompt ('Введите первое число')
let b = +prompt ('Введите второе число')
alert ( (a + b) /2 )
=======================================*/
/* ===============================================
let a = +prompt ('Введите длину стороны квадрата')
alert ('Площадь квадрата = ' + (a ** 2) )
==================================================*/
//===============  PZ   ====================
//===============  PZ   ====================
//===============  PZ   ====================
//===============  PZ   ====================
/*====================================
let number = +prompt ( 'Введите число' )
if (0 < number) {
    alert ('Число положительное')
} else if (0 > number) {
    alert ('Число отрицательное')
} else {
    alert ('Число равно нулю')
}
=======================================*/
/*=======================================================
let age = +prompt ('Введите Ваш возраст')
if ( 0 < age && age <= 120) {
    alert ('Ну ладно!')
} else {
    alert ('Не звезди(те)!')
}
=========================================================*/
var userName = prompt("Кто там?", '');
if (userName === 'Админ') {
    var password = prompt('Пароль?', '');
    if (password === 'Я главный') {
        alert('Здравствуйте!');
    }
    else if (password === '' || password === null) {
        alert('Отменено');
    }
    else {
        alert('Неверный пароль');
    }
}
else if (userName === '' || userName === null) {
    alert('Отменено');
}
else {
    alert("Я вас не знаю");
}
