/*
let a = prompt ('Введите число')
alert (a ** 2)
===================================*/
/*
let a = +prompt ('Введите первое число')
let b = +prompt ('Введите второе число')
alert ( (a + b) /2 )
=======================================*/
/*
let a = +prompt ('Введите длину стороны квадрата')
alert ('Площадь квадрата = ' + (a ** 2) )
==================================================*/
//===============  PZ   ====================
//===============  PZ   ====================
//===============  PZ   ====================
//===============  PZ   ====================
/*
let number = +prompt ( 'Введите число' )
if (0 < number) {
    alert ('Число положительное')
} else if (0 > number) {
    alert ('Число отрицательное')
} else {
    alert ('Число равно нулю')
}
=======================================*/
/*
let age = +prompt ('Введите Ваш возраст')
if ( 0 < age && age <= 120) {
    alert ('Ну ладно!')
} else {
    alert ('Не звезди(те)!')
}
=========================================================*/
/*
let userName = prompt("Кто там?", '')
if (userName === 'Админ') {
    let password = prompt('Пароль?', '')
    if (password === 'Я главный') {
    alert( 'Здравствуйте!' )
    } else if (password === '' || password === null) {
    alert( 'Отменено' )
    } else {
    alert( 'Неверный пароль' )
    }

} else if (userName === '' || userName === null) {
    alert( 'Отменено' )
} else {
    alert( "Я вас не знаю" )
}
=========================================================*/
/*1. Написать функцию, которая принимает 2 строки и сравнивает их длину. Функция возвращает 1, если в первой строке больше символов, чем во второй; -1 – если во второй больше символов, чем в первой; или 0 – если строки одинаковой длины.
*/
var firstStr = 'abc';
var secondStr = 'abcd';
function compareLines(firstStr, secondStr) {
    if (firstStr.length > secondStr.length) {
        return 1;
    }
    else if (firstStr.length < secondStr.length) {
        return -1;
    }
    return 0;
}
console.log(compareLines(firstStr, secondStr));
